
package org.example.gimazieva;
public class App3 {
    public static void checkNegativeNumber(int number) {
        if (number < 0) {
            System.out.println("true");
        } else {
            System.out.println("false");
        }

    }
        public static void main (String[]args) {
            checkNegativeNumber(20);
        }
}
   // Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
//
